zephyrproject-rtos/hal_nxp/mcux/drivers/kinetis/fsl_hsadc.c
    /* CALIB */
    /* Set the calibration mode.
     * Hardware requires that the bit REQSINGA, REQDIFA, REQA, REQSINGB, REQDIFB, REQB in CALIB register can't be set
     * at the same time. They must be set as the sequency description in the reference manual.
     */
    if (kHSADC_ConverterA == (kHSADC_ConverterA & converterMask))
    {
        if (kHSADC_CalibrationModeSingleEnded == (kHSADC_CalibrationModeSingleEnded & calibrationModeMask))
        {
            base->CALIB |= HSADC_CALIB_REQSINGA_MASK;
        }
        if (kHSADC_CalibrationModeDifferential == (kHSADC_CalibrationModeDifferential & calibrationModeMask))
        {
            base->CALIB |= HSADC_CALIB_REQDIFA_MASK;
        }
        base->CALIB |= HSADC_CALIB_CAL_REQA_MASK;
    }
    if (kHSADC_ConverterB == (kHSADC_ConverterB & converterMask))
    {
        if (kHSADC_CalibrationModeSingleEnded == (kHSADC_CalibrationModeSingleEnded & calibrationModeMask))
        {
            base->CALIB |= HSADC_CALIB_REQSINGB_MASK;
        }
        if (kHSADC_CalibrationModeDifferential == (kHSADC_CalibrationModeDifferential & calibrationModeMask))
        {
            base->CALIB |= HSADC_CALIB_REQDIFB_MASK;
        }
        base->CALIB |= HSADC_CALIB_CAL_REQB_MASK;
    }

    /* Trigger the calibration. */
    HSADC_DoSoftwareTriggerConverter(base, converterMask);
}

/*!
 * brief Gets the calibration result value.
 *
 * This function returns the single ended calibration value and differential calibration value for converter A and
 * converter B. The calibration value of each calibration mode for each converter can be received from this function's
 * return value by using the mask and shift definition from HSADC_CALIBRATION_VALUE_A_SINGLE_ENDED_MASK to
 * HSADC_CALIBRATION_VALUE_B_DIFFERENTIAL_SHIFT.
 *
 * param base                HSADC peripheral base address.
 * return                    Calibration value for converter A and converter B.
 */
uint32_t HSADC_GetCalibrationResultValue(HSADC_Type *base)
{
    return (((uint32_t)(base->CALVAL_A) << 16U) + base->CALVAL_B);
}

/*!
 * brief Enables or disables the calibration result value.
 *
 * This function enables or disables converter A and converter B to use the calibration values to obtain the final
 * conversion result by calibration sum operation.
 *
 * param base          HSADC peripheral base address.
 * param converterMask Mask for converters to be operated. See the "_hsadc_converter_id".
 * param enable        Enable or disable the feature.
 */
void HSADC_EnableCalibrationResultValue(HSADC_Type *base, uint16_t converterMask, bool enable)
{
    /* CALIB */
    /* Enable means not to bypass the calibration operation. */
    if (kHSADC_ConverterA == (kHSADC_ConverterA & converterMask))
    {
        if (true == enable)
        {
            base->CALIB &= ~HSADC_CALIB_BYPA_MASK;
        }
        else
        {
            base->CALIB |= HSADC_CALIB_BYPA_MASK;
        }
    }
    if (kHSADC_ConverterB == (kHSADC_ConverterB & converterMask))
    {
        if (true == enable)
        {
            base->CALIB &= ~HSADC_CALIB_BYPB_MASK;
        }
        else
        {
            base->CALIB |= HSADC_CALIB_BYPB_MASK;
        }
    }
}
